{"config": [{"config": {"trainable": true, "kernel_size": [3, 3], "name": "conv2d_34", "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l2": 0.10000000149011612, "l1": 0.0}, "class_name": "L1L2"}, "strides": [1, 1], "dtype": "float32", "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 200, 200, 1], "filters": 64, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_34", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_size": [3, 3], "name": "conv2d_35", "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l2": 0.10000000149011612, "l1": 0.0}, "class_name": "L1L2"}, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "filters": 128, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_35", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_size": [3, 3], "name": "conv2d_36", "dilation_rate": [1, 1], "kernel_regularizer": {"config": {"l2": 0.10000000149011612, "l1": 0.0}, "class_name": "L1L2"}, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "filters": 256, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_36", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_12", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 111, "bias_regularizer": null, "name": "dense_12", "kernel_regularizer": {"config": {"l2": 0.10000000149011612, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "2.1.0", "class_name": "Sequential", "backend": "tensorflow"}