{"keras_version": "2.1.0", "config": [{"config": {"batch_input_shape": [null, 200, 200, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "strides": [1, 1], "name": "conv2d_49", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "trainable": true, "kernel_constraint": null, "dtype": "float32", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_49", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_50", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "trainable": true, "kernel_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_50", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_51", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 128, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "valid", "trainable": true, "kernel_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_51", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_17", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_20", "units": 256, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_21", "units": 111, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}