{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.0", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 200, 200, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "kernel_constraint": null, "name": "block1_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "kernel_constraint": null, "name": "block1_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block1_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "kernel_constraint": null, "name": "block2_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "kernel_constraint": null, "name": "block2_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block2_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "bias_constraint": null, "kernel_constraint": null, "name": "block3_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "bias_constraint": null, "kernel_constraint": null, "name": "block3_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "bias_constraint": null, "kernel_constraint": null, "name": "block3_conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block3_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "name": "block4_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "name": "block4_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "name": "block4_conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block4_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "name": "block5_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "name": "block5_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Conv2D", "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": false, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "kernel_constraint": null, "name": "block5_conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "block5_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activity_regularizer": null}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "use_bias": true, "bias_regularizer": null, "units": 111, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "activity_regularizer": null}}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}}