{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.0", "config": {"input_layers": [["input_9", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_9", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 200, 200, 3], "name": "input_9", "sparse": false}}, {"class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_9", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block1_conv1", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block1_conv2", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"trainable": false, "name": "block1_pool", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block2_conv1", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block2_conv2", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"trainable": false, "name": "block2_pool", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block3_conv1", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block3_conv2", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block3_conv3", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"trainable": false, "name": "block3_pool", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block4_conv1", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block4_conv2", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block4_conv3", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"trainable": false, "name": "block4_pool", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block5_conv1", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block5_conv2", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "block5_conv3", "bias_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "padding": "same", "kernel_regularizer": null, "activation": "relu", "trainable": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"trainable": false, "name": "block5_pool", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "name": "flatten_9", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_9"}}, {"class_name": "Dense", "name": "dense_17", "inbound_nodes": [[["flatten_9", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "dense_17", "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "name": "dense_18", "inbound_nodes": [[["dense_17", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "name": "dense_18", "units": 111, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activation": "softmax", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_3", "output_layers": [["dense_18", 0, 0]]}}