{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2d_68", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "activation": "linear", "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "batch_input_shape": [null, 200, 200, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_67", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_67", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2d_69", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "activation": "linear", "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_68", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_68", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2d_70", "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "use_bias": true, "activation": "linear", "filters": 128, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_69", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_69", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_23", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "units": 111, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}}}], "keras_version": "2.1.0", "backend": "tensorflow"}