{"class_name": "Sequential", "keras_version": "2.1.0", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "batch_input_shape": [null, 200, 200, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_7", "padding": "valid", "filters": 64, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dtype": "float32", "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_7", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "name": "conv2d_8", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "filters": 128, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_8", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "name": "conv2d_9", "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "filters": 256, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_9", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "softmax", "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "units": 111, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}], "backend": "tensorflow"}