{"keras_version": "2.1.0", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 200, 200, 1], "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_last", "activation": "linear", "name": "conv2d_121", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [5, 5], "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "trainable": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_73", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_121", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "name": "conv2d_122", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "trainable": true, "activation": "linear", "padding": "valid", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_74", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_122", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "filters": 128, "name": "conv2d_123", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "trainable": true, "activation": "linear", "padding": "valid", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_75", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_123", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_41", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "softmax", "name": "dense_41", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "trainable": true, "units": 111, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null}}], "backend": "tensorflow"}