{"config": [{"config": {"dilation_rate": [1, 1], "name": "conv2d_1", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "padding": "valid", "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 32, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_constraint": null, "batch_input_shape": [null, 200, 200, 1]}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "padding": "valid", "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 32, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "padding": "valid", "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 64, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "padding": "valid", "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 128, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "units": 111}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.0", "class_name": "Sequential"}