{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.0", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 200, 200, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "name": "conv2d_1", "dtype": "float32", "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [5, 5], "filters": 32, "strides": [1, 1], "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "use_bias": true, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [5, 5], "filters": 64, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "use_bias": true, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "filters": 128, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "trainable": true, "units": 20, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "softmax", "use_bias": true, "bias_constraint": null}}]}