{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.0", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [7, 7], "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "batch_input_shape": [null, 200, 200, 1], "padding": "valid", "trainable": true, "name": "conv2d_7", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_7", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 64, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "name": "conv2d_8", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_8", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "filters": 128, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "name": "conv2d_9", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_9", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "softmax", "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_3", "units": 111}}]}