{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_regularizer": null, "trainable": true, "filters": 32, "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 200, 200, 1], "dtype": "float32", "kernel_size": [5, 5], "padding": "valid", "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "trainable": true, "filters": 64, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "kernel_size": [5, 5], "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "trainable": true, "filters": 128, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 20, "activation": "softmax", "activity_regularizer": null}}], "keras_version": "2.1.0"}