{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "name": "conv2d_22", "filters": 64, "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "dtype": "float32", "batch_input_shape": [null, 200, 200, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "kernel_size": [5, 5], "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_22", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "name": "conv2d_23", "filters": 128, "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_23", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "name": "conv2d_24", "filters": 256, "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_24", "data_format": "channels_last", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_8", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 50, "bias_constraint": null, "name": "dense_8", "activation": "softmax", "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.0"}