{"class_name": "Sequential", "keras_version": "2.1.0", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "batch_input_shape": [null, 200, 200, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "filters": 32, "activation": "linear", "bias_constraint": null, "name": "conv2d_72", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_46"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_72"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "activation": "linear", "bias_constraint": null, "name": "conv2d_73", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_47"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_73"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "activation": "linear", "bias_constraint": null, "name": "conv2d_74", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_48"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_74"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_23"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 111, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "name": "dense_30", "bias_regularizer": null}}]}